packages/inductiva/inductiva-0.3.6-py3-none-any.whl/inductiva/templates/wind_terrain/openfoam/files/0/include/ABLConditions_template.openfoam.jinja
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

Uref                 10.0;
Zref                 20;
zDir                 (0 0 1);
flowDir              ({{ wind_flow_dir[0] }} {{ wind_flow_dir[1] }} {{ wind_flow_dir[2] }});
z0                   uniform 0.1;
zGround              uniform {{ terrain_bounds["z"][0] }};

// ************************************************************************* //
